letters = 'abcdefghijklmnopqrstuvwxyz'
print (letters[:])#Отримати послідовність символів від початку і до кінця.
#'abcdefghijklmnopqrstuvwxyz'
print (letters[20:])#Отримати послідовність символів від 20-го символа і до кінця.
#'uvwxyz'
print (letters[12:15])#Отримати послідовність символів від 12-го символа по 15-й (15-й символ не включається). 
#'mno'
print (letters[-5:])#Отримати послідовність останніх 5 символів. 
#'vwxyz'
print (letters[18:-3])#Отримати послідовність символів від 18-го символа і до 3-го з кінця (3-й символ з кінця не включається). 
#'stuvw'
print (letters[-6:-2])#Отримати послідовність символів від 6-го символа з кінця і до 2-го символа з кінця (2-й символ з кінця не включається). 
#'uvwx'
print (letters[::7])#Отримати кожний 7-й символ з початку і до кінця. 
#'ahov'
print (letters[4:20:3])#Отримати кожний 3-й символ від 4-го символа з початку і до 20-го символа (20-й символ не включається). 
#'ehknqt'
print (letters[19::4])#Отримати кожний 4-й символ починаючи від 19-го символа і до кінця. 
#'tx'
print (letters[:21:5])#Отримати кожний 5-й символ починаючи з початку і до 21-го символа (21-й символ не включається). 
#'afkpu'
print (letters[::-1])#Перевернути рядок з кінця на початок. 
#'zyxwvutsrqponmlkjihgfedcba'
print (letters[60:70])#Вказування неправильних початкового і кінцевого індексів дає порожній рядок.
#'' 