print('dec: {:d} hex: {:x} bin: {:b}'.format(15, 15, 15))  # dec: 15 hex: f bin: 1111 # змінювати розрядність представлення цілих чисел (десяткові, вісімкові, шістнадцяткові та ін.);

print('pi: {:0.3}'.format(3.1415))  # pi: 3.14 # змінювати точність представлення дробових чисел (округлювати до вказаної кількості знаків);

print('"{}" "{:+}" "{:-}" "{: }"'.format(1, 2, -3, 4))  # "1" "+2" "-3" " 4" #відображати знак чисел

print("|{:<10}|{:*^10}|{:>10}|".format('left', 'center', 'right'))  # |left      |**center**|     right| # вирівняти положення елементу і чим (якими символами) доповнити;


