is_next = None
num = int(input("Enter the number of points: "))
if num >=83:
    is_next = True
else:
    is_next = False
print (f"is next = {is_next}")
""""
У першому модулі всі наші програми виконувалися лінійно. Для простих програм цього цілком достатньо, але при необхідності прийняття рішень ми приходимо до розгалуження. У Python розгалуження здійснюється за допомогою ключового слова if. Якщо результатом умовного виразу буде True (Істина), то тіло умови виконається, якщо False (Хиба) — тіло буде пропущено.

num = float(input("Введіть число: "))

if num >= 0:
    result = "Число не від'ємне"
if num < 0:
    result = "Число від'ємне"

print(result)
У виразі if ми використали оператори відношень. Оператори відношень в мові Python можна звести до наступної таблиці.

Оператор відношення	Значення
<	Менше
<=	Менше або дорівнює
>	Більше
>=	Більше або дорівнює
==	Дорівнює
!=	Не дорівнює
Але найчастіше ми використовуватимемо вираз if-else. У цьому виразі, якщо результат виразу буде True, виконається тіло умовного виразу if, а тіло else буде пропущено. Інакше все буде навпаки. Перепишемо попередній приклад:

num = float(input("Введіть число: "))

if num >= 0:
    result = "Число невід'ємне"
else:
    result = "Число від'ємне"

print(result)
Як бачимо, у нашому випадку ця конструкція краща, тому що ми використовуємо лише одну умову перевірки.
"""